tap "coder/coder"
tap "shopify/shopify"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Tool for glamorous shell scripts
brew "gum"
# Kubernetes package manager
brew "helm"
# Run local Kubernetes cluster in Docker
brew "kind"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Provisions remote development environments via Terraform
brew "coder/coder/coder"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
cask "font-blex-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Modern GUI for Redis
cask "medis"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@11"
# Open-source code editor
cask "visual-studio-code"
vscode "bbenoist.nix"
vscode "bierner.jsdoc-markdown-highlighting"
vscode "bierner.markdown-emoji"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "idleberg.applescript"
vscode "idleberg.jxa"
vscode "janne252.fontawesome-autocomplete"
vscode "jnoortheen.nix-ide"
vscode "kumar-harsh.graphql-for-vscode"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.blazorwasm-companion"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.mono-debug"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "shadowtime2000.eta-vscode"
vscode "shopify.polaris-for-vscode"
vscode "sissel.shopify-liquid"
vscode "statelyai.stately-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
